expand to iroh, improve error handling
